# Tema 5.1: Procesamiento de datos simple

In [2]:
#EJERCICIO: Importa el dataset BostonHousing.csv (en un dataframe de pandas llamado datos) y muestra las primeras filas

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

## 1. Añadir o eliminar columnas de un dataframe

- **Crear nuevas columnas**

Para añadir una nueva columna, directamente hacemos:

```dataframe['nombre_columna'] = ...```

Esta nueva columna se añadirá al final del dataframe.

In [3]:
#EJEMPLO: Creamos una nueva columna en datos2 que sea la columna 'age'- 2

datos['age_modified']= datos['age'] - 2
datos.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv,age_modified
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0,63.2
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6,76.9
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7,59.1
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4,43.8
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2,52.2

Si quisiéramos realizar la transformación sobre la columna original (no crear una nueva):

```datos['age'] = datos['age'] - 2```

- **Eliminar columnas**

Para eliminar columnas en Python, utilizamos la función *drop*:

```dataframe = dataframe.drop('nombre_columna', axis=1)```

El axis = 1 se especifica para indicar que estamos eliminando una columna: ponemos axis = 0 si queremos eliminar una fila.

Dentro de la función drop se pueden indicar tantas columnas como se quieran eliminar, en forma de lista: 

```dataframe = dataframe.drop(['columna1', 'columna2'], axis=1)```

In [5]:
#EJERCICIO: Crea un nuevo dataframe, datos2, que sea igual que datos pero eliminando las columnas 'chas' y 'zn'

,crim,indus,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv,age_modified
0,0.00632,2.31,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0,63.2
1,0.02731,7.07,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6,76.9
2,0.02729,7.07,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7,59.1
3,0.03237,2.18,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4,43.8
4,0.06905,2.18,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2,52.2

## 2. Ordenar registros de un dataframe

Si queremos ordenar las filas de un dataframe en base a una columna, utilizamos la función *sort_values*:

```dataframe = dataframe.sort_values(by = 'nombre_columna', ascending=False)```

De esta forma, los registros se ordenarían de mayor a menor. Si queremos que se ordenen de menor a mayor, no es necesario especificar el parámetro *ascending* (por defecto, toma el valor True).

In [3]:
#EJERCICIO: Ordena el último dataframe creado (datos2) en base a la columna 'crim', de mayor a menor

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
380,88.9762,0.0,18.1,0,0.671,6.968,91.9,1.4165,24,666,20.2,396.90,17.21,10.4
418,73.5341,0.0,18.1,0,0.679,5.957,100.0,1.8026,24,666,20.2,16.45,20.62,8.8
405,67.9208,0.0,18.1,0,0.693,5.683,100.0,1.4254,24,666,20.2,384.97,22.98,5.0
410,51.1358,0.0,18.1,0,0.597,5.757,100.0,1.4130,24,666,20.2,2.60,10.11,15.0
414,45.7461,0.0,18.1,0,0.693,4.519,100.0,1.6582,24,666,20.2,88.27,36.98,7.0

## 3. Renombrar columnas de un dataframe

Para renombrar columnas utilizamos la función *rename*:

```dataframe.rename(columns={'nombre_col1':'nombre_nuevo_col1', 'nombre_col2':'nombre_nuevo_col2',...}, inplace=True)```

In [4]:
#EJERCICIO: Renombra las columnas del dataframe datos2
    # crim -> criminalidad
    # medv -> precio

datos2.rename(columns={'crim':'criminalidad', 'medv':'precio'},inplace=True) 
datos2.head()

,criminalidad,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,precio
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

## 4. Eliminar duplicados

- **Comprobar valores duplicados**

Para comprobar si un dataframe contiene filas duplicadas, podemos usar la función *duplicated*:

```dataframe.duplicated().sum()```

Si queremos ver si se repiten valores en una columna determinada, rellenamos el argumento *subset*:

```dataframe = dataframe.duplicated(subset=['nombre_columna']).sum()```

- **Eliminar filas con duplicados**

Para eliminar filas con valores duplicados (en una o varias columnas), utilizamos la función *drop_duplicates*:

```dataframe.drop_duplicates(subset=['nombre_columna'])```

In [5]:
#EJERCICIO: Comprueba si hay valores repetidos en la columna 'age' del dataframe datos2. 
#En caso de que los haya, elimina dichos registros del dataframe.
#Comprueba que en el nuevo dataframe ya no hay duplicados

datos2.duplicated(subset=['age']).sum()

150

In [6]:
datos2=datos2.drop_duplicates(subset=['age'])

In [7]:
datos2.duplicated(subset=['age']).sum()

0

## 5. Modificar tipos de datos

Para ver los tipos de datos que tienen las columnas de un dataframe, ya vimos la función *dtypes*:

In [8]:
datos2.dtypes

criminalidad    float64
zn              float64
indus           float64
chas              int64
nox             float64
rm              float64
age             float64
dis             float64
rad               int64
tax               int64
ptratio         float64
b               float64
lstat           float64
precio          float64
dtype: object

En Python, podemos quedarnos las columnas de un tipo determinado con la función *select_dtypes*. Por ejemplo:

```dataframe_numeric = dataframe.select_dtypes(include=["float", "integer"])```

In [14]:
#Ejemplo: seleccionamos las columnas de tipo integer de datos5 y las guardamos en un nuevo dataframe (datos_int)

datos_int=datos5.select_dtypes(include=["int"]) 
datos_int.columns #comprobamos qué columnas tiene este nuevo dataframe: solo las de tipo integer

Index(['rad', 'tax'], dtype='object')

Si queremos transformar una columna a otro tipo, podemos utilizar la función *astype*. Por ejemplo:

```dataframe['nombre_columna']= dataframe['nombre_columna'].astype(int)```

In [15]:
#EJERCICIO: Transforma las columnas de tipo integer del dataframe datos2 a tipo float
#Comprueba que se han transformado correctamente

#Forma 1: transformamos de una en una

datos2['rad'] = datos2['rad'].astype(float)
datos2['tax'] = datos2['tax'].astype(float)

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [16]:
datos2.dtypes

criminalidad    float64
indus           float64
nox             float64
rm              float64
age             float64
dis             float64
rad             float64
tax             float64
ptratio         float64
b               float64
lstat           float64
precio          float64
age_modified    float64
dtype: object

In [9]:
#Forma 2: transformamos todas las columnas integer automáticamente:

columnas_int=list(datos2.select_dtypes(include=["int"]).columns)

In [10]:
for col in columnas_int: #recorre las columnas que hemos seleccionado y las transforma a float

    datos2[col]=datos2[col].astype(float)

In [11]:
datos2.dtypes

criminalidad    float64
zn              float64
indus           float64
chas            float64
nox             float64
rm              float64
age             float64
dis             float64
rad             float64
tax             float64
ptratio         float64
b               float64
lstat           float64
precio          float64
dtype: object

## 6. Filtros

Los filtros consisten en quedarnos solamente con aquellas filas que cumplan una determinada condición en alguna/s de sus columnas. Por ejemplo, queremos quedarnos con las filas en las cuales la columna 1 toma un valor determinado:

```dataframe_filtered = dataframe[dataframe['columna1'] == valor]```


Si queremos aplicar filtros sobre varias columnas, utilizamos '&' (si queremos que se cumplan todas las condiciones) o '|' (si queremos que se cumpla alguna de las condiciones). Por ejemplo:


```dataframe_filtered = dataframe[(dataframe['columna1'] == valor1) & (dataframe['columna2'] == valor2)]```

In [4]:
#EJERCICIO: Quédate con aquellos registros del dataframe original (datos) cuyo valor en 'crim' sea superior a 70 
#¿Cuántos registros lo cumplen?

data_filtered1=datos[datos['crim']>=70]
data_filtered1.shape[0]

2

In [5]:
data_filtered1

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv,age_modified
380,88.9762,0.0,18.1,0,0.671,6.968,91.9,1.4165,24,666,20.2,396.90,17.21,10.4,89.9
418,73.5341,0.0,18.1,0,0.679,5.957,100.0,1.8026,24,666,20.2,16.45,20.62,8.8,98.0

In [6]:
#EJERCICIO: Quédate con aquellos registros del dataframe original (datos) que cumplan las siguientes condiciones:

# Columna 'age' superior o igual a 50
# Columna 'indus' inferior a 2
# Columna 'rad' superior a 1

data_filtered2=datos[(datos['age']>=50)&(datos['indus']<2)&(datos['rad']>1)]
data_filtered2.shape[0]

1

In [7]:
#EJERCICIO: Quédate con aquellos registros del dataframe original (datos) cuyo valor 
# en la columna age sea inferior a 40 ó superior a 70

data_filtered3=datos[(datos['age']<40) | (datos['age']>70)] 
data_filtered3.shape[0]

395

## 7. Cálculo de agregados

- **Agregados de una columna**

```dataframe['nombre_columna'].function()```

In [8]:
datos["age"].quantile(0.25)

45.025

In [9]:
datos["age"].quantile(0.75)

94.07499999999999

In [10]:
datos["age"].max()

100.0

In [11]:
datos["age"].mean()

68.57490118577078

In [12]:
datos["age"].min()

2.9

- **Agregados de varias columnas a la vez**

```dataframe[['columna1', 'columna2', ...]].function()```

In [13]:
datos[["age", "crim", 'nox']].max()

age     100.0000
crim     88.9762
nox       0.8710
dtype: float64

- **Agregados con agrupaciones: *groupby***

Si queremos hacer cálculos agrupando por los valores que toma una columna (o varias), usamos *groupby* y *agg*:

```dataframe.groupby('columna1').agg({'columna2':'mean', 'columna3 : 'max', ...}```

In [14]:
datos.groupby('rad').agg({'age':'mean'}) #agrupamos por 'rad' y sacamos la media de 'age' para cada grupo de'rad'

           age
rad
1    45.025000
2    64.770833
3    49.310526
4    60.841818
5    69.223478
6    60.142308
7    40.141176
8    67.350000
24   89.805303

In [15]:
datos.groupby('rad').agg({'age':'max', 'ptratio': 'mean'}) #se pueden hacer agregados por varias columnas a la vez (max de Fare y media de Age agrupando por sexo)

       age    ptratio
rad
1     91.0  17.565000
2     97.0  17.291667
3     95.6  18.168421
4    100.0  19.136364
5    100.0  16.546957
6     95.4  17.815385
7     79.2  18.405882
8     93.4  17.975000
24   100.0  20.200000